In [1]:
import psycopg2
import psycopg2.extras
import pandas as pd

In [3]:
class PostgresConnection(object):
    def __init__(self):
        self.connection = psycopg2.connect(database = "ecomdb",
                                          user = "postgres",
                                          password = "*",
                                          host = "127.0.0.1",
                                          port = "5432")
    def getConnection(self):
        print("Connection to DB established!")
        return self.connection
con = PostgresConnection().getConnection()

Connection to DB established!

**Q1: Find the division/district/year/month wise total_sale_price joining fact table and respective dimension table. **

division wise total_sale_price joining fact table and store dimension table

In [5]:
con = PostgresConnection().getConnection()
insert_stmt = """SELECT store_dim.division as "Division", SUM(fact_table.total_price) "Total Sale Price" 
FROM star_schema.fact_table 
JOIN star_schema.store_dim ON store_dim.store_key = fact_table.store_key 
GROUP BY store_dim.division 
ORDER BY store_dim.division"""
cur = con.cursor()
# psycopg2.extras.execute_batch(cur, insert_stmt, fact_data.values)
total_price_by_division = pd.read_sql_query(insert_stmt, con)
con.commit()
cur.close()

Connection to DB established!

C:\Users\istia\anaconda3\lib\site-packages\pandas\io\sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

In [6]:
total_price_by_division

     Division  Total Sale Price
0     BARISAL        7520343.75
1  CHITTAGONG       19763595.00
2       DHAKA       40764619.75
3      KHULNA       11311610.50
4    RAJSHAHI       12099196.00
5     RANGPUR        8429836.50
6      SYLHET        5512234.25

district wise total_sale_price joining fact table and store dimension table

In [7]:
con = PostgresConnection().getConnection()
insert_stmt = """SELECT store_dim.district as "District", SUM(fact_table.total_price) "Total Sale Price" 
FROM star_schema.fact_table 
JOIN star_schema.store_dim ON store_dim.store_key = fact_table.store_key 
GROUP BY store_dim.district 
ORDER BY store_dim.district"""
cur = con.cursor()
# psycopg2.extras.execute_batch(cur, insert_stmt, fact_data.values)
total_price_by_district = pd.read_sql_query(insert_stmt, con)
con.commit()
cur.close()

Connection to DB established!

C:\Users\istia\anaconda3\lib\site-packages\pandas\io\sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

In [8]:
total_price_by_district

      District  Total Sale Price
0     BAGERHAT        1307651.00
1    BANDARBAN         995360.75
2      BARGUNA         869041.00
3      BARISAL        2897237.75
4        BHOLA        1012205.75
..         ...               ...
59   SIRAJGANJ        1295100.75
60   SUNAMGANJ        1593774.00
61      SYLHET        1727717.25
62     TANGAIL        1774650.25
63  THAKURGAON         729934.25

[64 rows x 2 columns]

year wise total_sale_price joining fact table and Time dimension table

In [9]:
con = PostgresConnection().getConnection()
insert_stmt = """SELECT time_data.year as "Year", SUM(fact_table.total_price) "Total Sale Price"
FROM star_schema.fact_table
JOIN star_schema.time_data ON time_data.time_key = fact_table.time_key
GROUP BY time_data.year
ORDER BY time_data.year"""
cur = con.cursor()
# psycopg2.extras.execute_batch(cur, insert_stmt, fact_data.values)
total_price_by_year = pd.read_sql_query(insert_stmt, con)
con.commit()
cur.close()

Connection to DB established!

C:\Users\istia\anaconda3\lib\site-packages\pandas\io\sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

In [10]:
total_price_by_year

   Year  Total Sale Price
0  2014       14334731.25
1  2015       15095720.25
2  2016       14976508.25
3  2017       15015806.00
4  2018       15108197.25
5  2019       14949510.25
6  2020       15037190.25
7  2021         883772.25

month wise total_sale_price joining fact table and Time dimension table

In [11]:
con = PostgresConnection().getConnection()
insert_stmt = """SELECT time_data.month as "Month", SUM(fact_table.total_price) "Total Sale Price"
FROM star_schema.fact_table
JOIN star_schema.time_data ON time_data.time_key = fact_table.time_key
GROUP BY time_data.month
ORDER BY time_data.month"""
cur = con.cursor()
# psycopg2.extras.execute_batch(cur, insert_stmt, fact_data.values)
total_price_by_month = pd.read_sql_query(insert_stmt, con)
con.commit()
cur.close()

Connection to DB established!

C:\Users\istia\anaconda3\lib\site-packages\pandas\io\sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

In [12]:
total_price_by_month

    Month  Total Sale Price
0       1        9042244.00
1       2        8073877.50
2       3        8939152.00
3       4        8504634.75
4       5        9078002.50
5       6        8556853.00
6       7        9046580.00
7       8        8929475.25
8       9        8724326.50
9      10        8902783.75
10     11        8680026.00
11     12        8923480.50

**Q2: Find the customer/bank/transaction(cash/online) wise total_sale_price joining fact table and respective dimension table **

customer wise total sale price joining fact table and customer dimension table

In [13]:
con = PostgresConnection().getConnection()
insert_stmt = """SELECT customer_dim.name as "Name", SUM(fact_table.total_price) "Total Sale Price"
FROM star_schema.fact_table
JOIN star_schema.customer_dim ON customer_dim.coustomer_key = fact_table.coustomer_key
GROUP BY customer_dim.name
ORDER BY customer_dim.name"""
cur = con.cursor()
# psycopg2.extras.execute_batch(cur, insert_stmt, fact_data.values)
total_price_by_customer = pd.read_sql_query(insert_stmt, con)
con.commit()
cur.close()

Connection to DB established!

C:\Users\istia\anaconda3\lib\site-packages\pandas\io\sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

In [14]:
total_price_by_customer

              Name  Total Sale Price
0                -          20643.50
1             ????          21142.50
2            ?????          21085.50
3         ????? ??          12288.00
4           ??????          11010.00
...            ...               ...
4530  zeba parveen          11094.50
4531        zeenat          11523.00
4532    zenab khan          10292.25
4533   zina kumari          11193.00
4534       ziyabul           9965.75

[4535 rows x 2 columns]

bank wise total sale price joining fact table and Transaction dimension table

In [15]:
con = PostgresConnection().getConnection()
insert_stmt = """SELECT trans_dim.bank_name as "Bank Name", SUM(fact_table.total_price) "Total Sale Price"
FROM star_schema.fact_table
JOIN star_schema.trans_dim ON trans_dim.payment_key = fact_table.payment_key
GROUP BY trans_dim.bank_name
ORDER BY trans_dim.bank_name"""
cur = con.cursor()
# psycopg2.extras.execute_batch(cur, insert_stmt, fact_data.values)
total_price_by_bank= pd.read_sql_query(insert_stmt, con)
con.commit()
cur.close()

Connection to DB established!

C:\Users\istia\anaconda3\lib\site-packages\pandas\io\sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

In [16]:
total_price_by_bank

                                            Bank Name  Total Sale Price
0                                     AB Bank Limited        2728515.50
1                    Bangladesh Commerce Bank Limited        2730999.25
2                                   Bank Asia Limited        2687142.75
3                          Bengal Commercial Bank Ltd        2704554.25
4                                               Bkash        2689352.50
5                                   BRAC Bank Limited        2705795.75
6                               Citizens Bank Limited        2723215.25
7                                   City Bank Limited        2713952.50
8                   Community Bank Bangladesh Limited        2685751.50
9                                  Dhaka Bank Limited        2728366.00
10                          Dutch-Bangla Bank Limited        2692435.25
11                               Eastern Bank Limited        2687182.25
12                                  IFIC Bank Limited        2699759.75
13                                Jamuna Bank Limited        2689886.50
14                                Meghna Bank Limited        2700528.50
15                            Mercantile Bank Limited        2676578.50
16                               Midland Bank Limited        2688430.25
17                             Modhumoti Bank Limited        2715279.00
18                          Mutual Trust Bank Limited        2670030.50
19                                              Nagad        2699554.50
20                              National Bank Limited        2697294.25
21            National Credit & Commerce Bank Limited        2723363.00
22                                               None        2708515.75
23                                   NRB Bank Limited        2711595.25
24                            NRB Commercial Bank Ltd        2692016.25
25                                NRB Global Bank Ltd        2700088.00
26                                   One Bank Limited        2692043.25
27                                 Padma Bank Limited        2708084.25
28                               Premier Bank Limited        2690828.00
29                                 Prime Bank Limited        2698896.50
30                                Pubali Bank Limited        2682787.50
31                                             Rocket        2720974.50
32                                  Shimanto Bank Ltd        2685805.25
33  South Bangla Agriculture and Commerce Bank Lim...        2728115.25
34                             Southeast Bank Limited        2691275.75
35                              Standard Bank Limited        2727661.00
36                                 Trust Bank Limited        2720807.00
37                         United Commercial Bank Ltd        2696854.75
38                                Uttara Bank Limited        2707120.00

transaction wise total sale price joining fact table and Transaction dimension table

In [17]:
con = PostgresConnection().getConnection()
insert_stmt = """SELECT trans_dim.trans_type as "Transaction Type", SUM(fact_table.total_price) "Total Sale Price"
FROM star_schema.fact_table
JOIN star_schema.trans_dim ON trans_dim.payment_key = fact_table.payment_key
GROUP BY trans_dim.trans_type
ORDER BY trans_dim.trans_type"""
cur = con.cursor()
# psycopg2.extras.execute_batch(cur, insert_stmt, fact_data.values)
total_price_by_trans_type = pd.read_sql_query(insert_stmt, con)
con.commit()
cur.close()

Connection to DB established!

C:\Users\istia\anaconda3\lib\site-packages\pandas\io\sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

In [18]:
total_price_by_trans_type

  Transaction Type  Total Sale Price
0             card       94583038.50
1             cash        2708515.75
2           mobile        8109881.50

Total Sales in Barisal

In [19]:
con = PostgresConnection().getConnection()
insert_stmt = """SELECT store_dim.district as "District", SUM(fact_table.quantity) "Total Sales"
FROM star_schema.fact_table
JOIN star_schema.store_dim ON store_dim.store_key = fact_table.store_key
WHERE store_dim.district = 'BARISAL'
GROUP BY store_dim.district"""
cur = con.cursor()
# psycopg2.extras.execute_batch(cur, insert_stmt, fact_data.values)
total_sales_in_barisal = pd.read_sql_query(insert_stmt, con)
con.commit()
cur.close()

Connection to DB established!

C:\Users\istia\anaconda3\lib\site-packages\pandas\io\sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

In [20]:
total_sales_in_barisal

  District  Total Sales
0  BARISAL       163782

Total Sales in 2015

In [21]:
con = PostgresConnection().getConnection()
insert_stmt = """SELECT time_data.year as "Year", SUM(fact_table.quantity) "Total Sales"
FROM star_schema.fact_table
JOIN star_schema.time_data ON time_data.time_key = fact_table.time_key
WHERE time_data.year = '2015'
GROUP BY time_data.year"""
cur = con.cursor()
# psycopg2.extras.execute_batch(cur, insert_stmt, fact_data.values)
total_sales_in_2015 = pd.read_sql_query(insert_stmt, con)
con.commit()
cur.close()

Connection to DB established!

C:\Users\istia\anaconda3\lib\site-packages\pandas\io\sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

In [22]:
total_sales_in_2015

   Year  Total Sales
0  2015       859999

Total Sales in 2015 and in Barisal

In [23]:
con = PostgresConnection().getConnection()
insert_stmt = """SELECT time_data.year as "Year", store_dim.district as "District", SUM(fact_table.quantity) "Total Sales"
FROM star_schema.fact_table
JOIN star_schema.time_data 
ON time_data.time_key = fact_table.time_key 
JOIN star_schema.store_dim 
ON store_dim.store_key = fact_table.store_key
WHERE time_data.year = '2015'
AND store_dim.district = 'BARISAL'
GROUP BY time_data.year,store_dim.district"""
cur = con.cursor()
# psycopg2.extras.execute_batch(cur, insert_stmt, fact_data.values)
total_sales_in_2015_and_barisal = pd.read_sql_query(insert_stmt, con)
con.commit()
cur.close()

Connection to DB established!

C:\Users\istia\anaconda3\lib\site-packages\pandas\io\sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

In [24]:
total_sales_in_2015_and_barisal

   Year District  Total Sales
0  2015  BARISAL        23456

Q6: For each store(item supplier), what are the top three products offered that are most often purchased?

In [4]:
con = PostgresConnection().getConnection()
insert_stmt = """SELECT item_dim.supplier,
	item_dim.item_name, 
	SUM(quantity) as "Quantity Sales"
FROM star_schema.fact_table
JOIN star_schema.item_dim 
ON item_dim.item_key = fact_table.item_key
GROUP BY item_dim.supplier,
	item_dim.item_name
ORDER BY item_dim.supplier, 
	item_dim.item_name"""
cur = con.cursor()
# psycopg2.extras.execute_batch(cur, insert_stmt, fact_data.values)
top_three_products = pd.read_sql_query(insert_stmt, con)
con.commit()
cur.close()

Connection to DB established!

C:\Users\istia\anaconda3\lib\site-packages\pandas\io\sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

In [5]:
top_three_products

,supplier,item_name,Quantity Sales
0,BIGSO AB,100% Juice Box Variety 6.75 oz,23425
1,BIGSO AB,Advil 2 pill packets,23126
2,BIGSO AB,Coke Classic 12 oz cans,22636
3,BIGSO AB,"Dawn Ultra Dish Detergent, Original Scent",22832
4,BIGSO AB,Diet Coke - 12 oz cans,22206
...,...,...,...
259,NINGBO SEDUNO IMP & EXP CO.LTD,Starbuck's Pike Place,23621
260,NINGBO SEDUNO IMP & EXP CO.LTD,Sugar in the Raw Packets,22812
261,NINGBO SEDUNO IMP & EXP CO.LTD,Truvia Natural Sweetener,22723
262,NINGBO SEDUNO IMP & EXP CO.LTD,Waterloo Sparkling Blackcherry 12oz,21827
263,NINGBO SEDUNO IMP & EXP CO.LTD,Welch's 100% Juice Variety10 oz,22458

Q7: What products have been sold through card or mobile since X days?

In [6]:
con = PostgresConnection().getConnection()
insert_stmt = """SELECT item_dim.item_name, trans_dim.trans_type, time_data.date
FROM star_schema.fact_table
JOIN star_schema.item_dim ON item_dim.item_key = fact_table.item_key
JOIN star_schema.trans_dim ON trans_dim.payment_key = fact_table.payment_key
JOIN star_schema.time_data ON time_data.time_key = fact_table.time_key
WHERE time_data.date >= '2021-08-01'
GROUP BY item_name,trans_type,date 
ORDER BY item_name DESC"""
cur = con.cursor()
# psycopg2.extras.execute_batch(cur, insert_stmt, fact_data.values)
products_sold = pd.read_sql_query(insert_stmt, con)
con.commit()
cur.close()

Connection to DB established!

C:\Users\istia\anaconda3\lib\site-packages\pandas\io\sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

In [7]:
products_sold

                            item_name trans_type        date
0         Zoo Animal Cookies/Crackers       card  2021-08-01
1         Zoo Animal Cookies/Crackers       card  2021-09-01
2         Zoo Animal Cookies/Crackers       card  2021-10-01
3         Zoo Animal Cookies/Crackers       card  2021-12-01
4         Zoo Animal Cookies/Crackers     mobile  2021-08-01
...                               ...        ...         ...
1107  100% Juice Box Variety 6.75 oz        card  2021-10-01
1108  100% Juice Box Variety 6.75 oz        card  2021-11-01
1109  100% Juice Box Variety 6.75 oz        card  2021-12-01
1110  100% Juice Box Variety 6.75 oz        cash  2021-08-01
1111  100% Juice Box Variety 6.75 oz      mobile  2021-09-01

[1112 rows x 3 columns]

Q8: What season(quarter) is the worst for each product item? As example,

In [8]:
con = PostgresConnection().getConnection()
insert_stmt = """SELECT item_dim.item_name, quarter, SUM(quantity)
FROM star_schema.fact_table
JOIN star_schema.item_dim ON item_dim.item_key = fact_table.item_key
JOIN star_schema.time_data ON time_data.time_key = fact_table.time_key
GROUP BY(item_name, time_data.quarter)"""
cur = con.cursor()
# psycopg2.extras.execute_batch(cur, insert_stmt, fact_data.values)
worst_season = pd.read_sql_query(insert_stmt, con)
con.commit()
cur.close()

Connection to DB established!

C:\Users\istia\anaconda3\lib\site-packages\pandas\io\sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

In [9]:
worst_season

                                  item_name quarter   sum
0           100% Juice Box Variety 6.75 oz       Q1  5698
1           100% Juice Box Variety 6.75 oz       Q2  5876
2           100% Juice Box Variety 6.75 oz       Q3  6045
3           100% Juice Box Variety 6.75 oz       Q4  5806
4                A&W Root Beer - 12 oz cans      Q1  5965
...                                     ...     ...   ...
1031  Yoplait Original Yogurt Variety Pack       Q4  5737
1032            Zoo Animal Cookies/Crackers      Q1  5462
1033            Zoo Animal Cookies/Crackers      Q2  5508
1034            Zoo Animal Cookies/Crackers      Q3  5701
1035            Zoo Animal Cookies/Crackers      Q4  5520

[1036 rows x 3 columns]

Q9: Break down the total sales of items geographically (division-wise).

In [11]:
con = PostgresConnection().getConnection()
insert_stmt = """SELECT division, item_name, SUM(quantity)
FROM star_schema.fact_table
JOIN star_schema.store_dim ON store_dim.store_key = fact_table.store_key
JOIN star_schema.item_dim ON item_dim.item_key = fact_table.item_key
GROUP BY division, item_dim.item_name"""
cur = con.cursor()
# psycopg2.extras.execute_batch(cur, insert_stmt, fact_data.values)
total_sales_geographically = pd.read_sql_query(insert_stmt, con)
con.commit()
cur.close()

Connection to DB established!

In [12]:
total_sales_geographically

     division                              item_name   sum
0     BARISAL        100% Juice Box Variety 6.75 oz   1586
1     BARISAL             A&W Root Beer - 12 oz cans  1661
2     BARISAL        A&W Root Beer Diet - 12 oz cans  1499
3     BARISAL                   Advil 2 pill packets  1547
4     BARISAL          All Purpose Cleaner 409 Spray  1678
...       ...                                    ...   ...
1808   SYLHET        Welch's 100% Juice Variety10 oz  1073
1809   SYLHET     Wint O Green LifeSavers Sugar Free  1306
1810   SYLHET        Wonderful Pistachios (in shell)  1160
1811   SYLHET  Yoplait Original Yogurt Variety Pack   1272
1812   SYLHET            Zoo Animal Cookies/Crackers  1052

[1813 rows x 3 columns]

Q10: What are the average sales of products sales per store monthly?

In [14]:
con = PostgresConnection().getConnection()
insert_stmt = """SELECT supplier, month, AVG(quantity)
FROM star_schema.fact_table
JOIN star_schema.item_dim ON item_dim.item_key = fact_table.item_key
JOIN star_schema.time_data ON time_data.time_key = fact_table.time_key
GROUP BY item_dim.supplier, time_data."month"
ORDER By item_dim.supplier"""
cur = con.cursor()
# psycopg2.extras.execute_batch(cur, insert_stmt, fact_data.values)
avg_sales_prod = pd.read_sql_query(insert_stmt, con)
con.commit()
cur.close()

Connection to DB established!

In [15]:
avg_sales_prod

                           supplier  month       avg
0                          BIGSO AB      1  5.986611
1                          BIGSO AB      2  6.048519
2                          BIGSO AB      3  6.004367
3                          BIGSO AB      4  5.987105
4                          BIGSO AB      5  5.971595
..                              ...    ...       ...
115  NINGBO SEDUNO IMP & EXP CO.LTD      8  5.961424
116  NINGBO SEDUNO IMP & EXP CO.LTD      9  5.967771
117  NINGBO SEDUNO IMP & EXP CO.LTD     10  5.990773
118  NINGBO SEDUNO IMP & EXP CO.LTD     11  6.032740
119  NINGBO SEDUNO IMP & EXP CO.LTD     12  5.986574

[120 rows x 3 columns]